package home.work01;

//общая информация-->

public class MyLife {
    public static void main(String[] args) {
        //тело метода
        System.out.println("(\"Лена -бабушка и мама двух прекрасных дочерей. \" +\n" +
                "        \"Покормить своих любимых.\" +\n" +
                "        \" С внучкой  в радость поиграть и с собакой погулять.\" +\n" +
                "        \" Дом, работа, книги, повязать, а там и спать.\" +\n" +
                "        \" Ну а как не помечтать! \" +\n" +
                "        \"Завтра вновь стремиться к цели, все задачи порешать.\"\n");
    }


}
